app/views/sessions/mainpage.html.erb

            <td><%= food[2] %></td>
            <td><%= check_box_tag "foods[#{food[0]},#{food[1]},#{food[2]}]", 'yes', @favourites.include?("#{food[0]}_#{food[1]}") ? true : false %></td>
---
SELECT DISTINCT restaurant, name, price FROM "foods"