app/controllers/sessions_controller.rb

    def compute
        id = session[:user_id]
        user = User.find(id)

        if params.has_key?(:foods)
            update_favourites(user, params[:foods].keys)
        elsif params[:session].has_key?(:budget)
            if user.update(:budget => params[:session][:budget])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "favourites" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["favourites", "[\"Khokha_Cheese roll\", \"false\"]\n[\"Khokha_Mayo roll\", \"false\"]\n"], ["updated_at", "2016-04-04 06:16:21.530342"], ["id", 1]]