app/controllers/sessions_controller.rb

    def profile
        session[:profile] = true
        @id = session[:user_id]
        @user = User.find(@id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

    def mainpage
        if session[:user_id].nil?
            redirect_to '/login'
        else
            session[:profile] = false
            @id = session[:user_id]
            @user = User.find(@id)
            @exotic = parse_meals(@user.exotic)
            @breakfast = parse_meals(@user.breakfast)
            @lunch = parse_meals(@user.lunch)
            @dinner = parse_meals(@user.dinner)
            @foods = Food.pluck('DISTINCT restaurant, name, price')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT DISTINCT restaurant, name, price FROM "foods"

    def update_budget
        id = session[:user_id]
        user = User.find(id)

        if user.update(:original_budget => params[:session][:budget])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "current_date" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["current_date", "2016-04-12 12:10:58.622786"], ["updated_at", "2016-04-12 12:10:58.629918"], ["id", 1]]

    def input_meal
        id = session[:user_id]
        user = User.find(id)

        if user.update(:budget => (user.budget - (params[:session][:amount].to_i)))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "dinner" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["dinner", "Superstore,Pizza,60\nPDC,Roti+Daal,45\n"], ["updated_at", "2016-04-11 20:11:46.485141"], ["id", 1]]

    def favourites
        id = session[:user_id]
        user = User.find(id)

        favs = params[:foods].keys
        favourites = ""
        favs.each do |food|
            favourites << "#{food}\n"
        end
        user.update(:favourites => favourites)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "favourites" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["favourites", "Khokha,Cheese roll,120\nKhokha,Chicken roll,100\nChop Chop,Chowmein,170\nSuperstore,Roll,130\nSuperstore,Pizza,60\n"], ["updated_at", "2016-04-12 05:50:54.264868"], ["id", 1]]

    def new_day
        id = session[:user_id]
        user = User.find(id)

        if user.remaining_days != -1
            if user[:budget] >= 0
                user.update(:good_days => user[:good_days]+1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "days_before_deadline" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["days_before_deadline", 13], ["updated_at", "2016-05-03 10:32:31.408139"], ["id", 7]]